# St7GetLSACombinationSRAName

Returns the spectral results filename used in linear load combination.

long St7GetLSACombinationSRAName(long uID, char* FileName, long MaxStringLen)
Input Parameters
uID
Strand7 model file ID.
MaxStringLen
Maximum number of characters allocated for FileName.
Output Parameters
FileName
Full path and name for the spectral results file.